Revit 2021.1 API
Alignment Properties
The Alignment type exposes the following members.
Properties
Name | Description
Description
 The Description of this alignment.
DisplayedEndStation
 The value of the displayed end station.
DisplayedStartStation
 The value of the displayed start station.
Element
 The underlying DirectShape element.
GUID
 The GUID of this alignment.
Name
 The Name of this alignment.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace